Repository: okfie984/replace-original-strings-in-wordpress
Catalog: languages/ros-*.po
Languages: ar

# Post Type General Name
source: Replace Strings
ar: استبدال عبارات ووردبريس

# Post Type Singular Name
source: Replace String
ar: استبدال عبارة

source: Replace Original Strings
ar: استبدال عبارات ووردبريس

source: Parent String
ar: العبارة الأساسية

source: All Strings
ar: كل العبارات

source: View String
ar: عرض العبارة

source: Add New String
ar: أضف عبارة جديدة

source: Add New
ar: أضف جديد

source: Edit String
ar: تحرير العبارة

source: Update String
ar: تحديث العبارة

source: Search String
ar: بحث عن عبارة

source: Not Found
ar: لم يتمّ إيجاد عبارات حتى الآن.

source: Not found in Trash
ar: لن يانّ إيجاد أيّ عبارات في سلّة المهملات

source: Original String
ar: العبارة الأصلية

source: Domain
ar: المجال

source: New String
ar: العبارة الجديدة

source: Match String
ar: تطابق العبارة

source: Not inserted
ar: لم يتمّ إدخالها

source: Edit this item
ar: تحرير هذه العبارة

source: Edit
ar: تحرير

source: Restore this item from the Trash
ar: استعادة هذه العبارة من سلّة المهملات

source: Restore
ar: استعادة

source: Move this item to the Trash
ar: نقل لسلة المهملات

source: Trash
ar: سلّة المهملات

source: Delete this item permanently
ar: إزالة بشكل دائم

source: Delete Permanently
ar: إزالة بشكل دائم

source: Undefined
ar: غير مُحَدد

source: Yes
ar: نعم

source: No
ar: لا

source: Strings Details
ar: تفاصيل العبارة المطلوب استبدالها

source: Text-Domain for original string
ar: المجال النصي للعبارة الأصلية

source: You can put the domain name for the original string to replace it for example woocommerce, when you keep this field empty will be replacing all strings in WP with the new string.
ar: يمكنك وضع اسم المجال للعبارة الأصلية لإستبدال هذه العبارة فقط ضمن المجال الذي وضعته على سبيل المثال: woocommerce، في حال تركت هذا الحقل فارغًا فإنّه سيتمّ استبدال العبارة الأصلية بالعبارة الجديدة في جميع الأماكن بالموقع.

source: Match String?
ar: تطابق العبارة؟

source: When you select "Yes" this means replace same this string/word only, or when you select "No" will be replacing that string/word at all places of the strings available whether first, last, or and in any other place in the strings.
ar: في حال اخترت "نعم" فإنّ عملية الاستبدال ستكون محصورة فقط على نفس الكلمة، وفي حالة اخترت "لا" هذا يعني أنّ العبارة الأصلية سيتمّ استبدالها بالعبارة الجديدة سواءً في بداية العبارات، أو نهايتها، أو أيّ مكان آخر بها نفس العبارة الأصلية.

source: Mohammad Okfie
ar: محمد عكفي
